resources/begrep/oppslagstjenesten/eksempler/14022014_integrasjonsguide_oppslagstjenesten_vedlegg3_soap_request.xml


<soapenv:Envelope xmlns:ns="http://kontaktinfo.difi.no/xsd/kontaktinfo/201310" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Timestamp wsu:Id="TS-3"><wsu:Created>2014-02-14T11:50:18.797Z</wsu:Created><wsu:Expires>2014-02-14T12:23:38.797Z</wsu:Expires></wsu:Timestamp><ds:Signature Id="SIG-2" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-1"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><InclusiveNamespaces PrefixList="ns" xmlns="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>NPEteq/06fqhXzy1i/AwPA1gBkM=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>AjPp48kTnTQ0alaV7qkiLuSK8oebewhtVE0oueycbO+Bpp+jxTHEcI9dTBT7vWhnCpfuYVpXz5SL
vvUjjgJoOSZA6U0ZGPXtJ9is8Jopi5TMHI+SNI9O7T5UO6Ti32hoUaxZdbwVgJkp3peZM3rYSqnB
CS8vXwLfEspdRv0wpS4=</ds:SignatureValue><ds:KeyInfo Id="KI-04E6DF1F27D1D9D39E13923786187672"><wsse:SecurityTokenReference wsu:Id="STR-04E6DF1F27D1D9D39E13923786187693"><wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3">MIICRzCCAbCgAwIBAgIEUGRU3zANBgkqhkiG9w0BAQUFADBoMQswCQYDVQQGEwJOTzEVMBMGA1UEChMMU29tZSBDb21wYW55MRYwFAYDVQQLEw1TZXJ2aWNlIE93bmVyMSowKAYDVQQDEyF0cnVzdGVkc2VydmljZW93bmVyLnNvbWVkb21haW4ubm8wHhcNMTIwOTI3MTMzMDA3WhcNMjIwODA2MTMzMDA3WjBoMQswCQYDVQQGEwJOTzEVMBMGA1UEChMMU29tZSBDb21wYW55MRYwFAYDVQQLEw1TZXJ2aWNlIE93bmVyMSowKAYDVQQDEyF0cnVzdGVkc2VydmljZW93bmVyLnNvbWVkb21haW4ubm8wgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBALNFznsWTNEvv89diqfc8yffvvSDzxKukKdEunNoo/HC/hSoRlLxDmyFA929XW/3cJfgOGmLX3chXn1CDUyQMh/Th7TbX4oMa1CP/lo2eYH0cbsg/uP+8LJfwMq1+ZeCer/qHBopzviFEdux28d85vcfXfKp9MXATKgpNnGjybcnAgMBAAEwDQYJKoZIhvcNAQEFBQADgYEAY8jDhuK9gVZ56WqhKDMy5h7jn/ZJRKmIw5T9PDqpyV9SUMesxmjHnGDJJKelRSFWygFdLpR9xBLHUvZp3nqtsjdpInD+lbwRGHf/iwEnXXh9OZx++72DPK32zYMydDpHot18Cf3cXB3I5KfFjR6CyuCZb/jDIzJQCkYZQq+xqjc=</wsse:KeyIdentifier></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header>
   <soapenv:Body wsu:Id="id-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <ns:hentKontaktinfoRequest>
         <ns:foedselsnummer>01010146468</ns:foedselsnummer>
      </ns:hentKontaktinfoRequest>
   </soapenv:Body>
</soapenv:Envelope>